Old_blog/README.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="localhost:8000/rss.xml"
      title="RSS feed for localhost:8000/">
<title>~/Documents/Github/rhyloo.github.io/drafts/Old_blog/README.org</title>
<meta name="author" content="Jorge Beanvides">
<meta name="referrer" content="no-referrer">
<link href= "./static/style.css" rel="stylesheet" type="text/css" />
<link rel="icon" href="./static/favicon.ico">
<link rel="apple-touch-icon-precomposed" href="./static/favicon-152.png">
<link rel="msapplication-TitleImage" href="./static/favicon-144.png">
<link rel="msapplication-TitleColor" href="#0141ff">
<link rel="stylesheet" href="./static/katex.min.css">
<meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1"></head>
<body>
<div id="preamble" class="status"><div class="header">
  <a href="https://rhyloo.github.io">Un ingeniero en problemas</a>
  <div class="sitelinks">
    <a href="https://github.com/rhyloo">Github</a> | <a href="https://rhyloo.github.io/projects.html">Projects</a> | <a href="https://rhyloo.github.io/about.html">About me</a>
  </div>
</div></div>
<div id="content">
<div class="post-date">09 dic. 2023</div><h1 class="post-title"><a href="localhost:8000/Old_blog/README.html">~/Documents/Github/rhyloo.github.io/drafts/Old_blog/README.org</a></h1>
<div id="outline-container-orgb6b54f6" class="outline-2">
<h2 id="orgb6b54f6">(<del>Rhyloo</del>)Plock</h2>
<div class="outline-text-2" id="text-orgb6b54f6">
<p>
<i>Aún cuando este repositorio tiene como nombre rhyloo, ya que es el
nickname que uso como tal el repositorio se llama "PLOCK" y el creador
es "Rhyloo"</i>
</p>
</div>
<div id="outline-container-org339edca" class="outline-3">
<h3 id="org339edca">Presentaciones (<a href="../emacs/Org/agenda.html">Cambiar el nombre del repositorio</a>)</h3>
<div class="outline-text-3" id="text-org339edca">
<p>
<a href="https://revealjs.com/#/">Reveal .js</a> es "The html presentation framewok" o eso dice su página,
lo vi en un tutorial de emacs sobre presentaciones(<a href="https://www.youtube.com/watch?v=bRoSpJ23Kzk&amp;list=PL9KxKa8NpFxIcNQa9js7dQQIHc81b0-Xg&amp;index=51">Using Emacs - Episode
50 - presentations</a>), me parece que podría ser útil para presentaciones
de la universidad o una página web de algún proyecto,ya que la mayor
parte por no decir todo lo hace Reveal .js tú solo tienes que escribir
el archivo .org.
</p>
</div>
<div id="outline-container-org7ec6d3d" class="outline-4">
<h4 id="org7ec6d3d">Contenido:</h4>
<div class="outline-text-4" id="text-org7ec6d3d">
<ul class="org-ul">
<li><span class="timestamp-wrapper"><span class="timestamp">[2019-08-30 vi. 13:41] </span></span> La presentación no tiene nada relevante, un
saludo de broma a mis amigos y ya está.</li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org1823429"></a><span class="todo TODO">TODO</span> Modificar la presentación a modo plantilla, posibles trabajos en la universidad<br></li>
</ul>
</div>
<div id="outline-container-org6dc38d3" class="outline-4">
<h4 id="org6dc38d3">Modificaciones:</h4>
<div class="outline-text-4" id="text-org6dc38d3">
<ul class="org-ul">
<li>Cambio de tema: Por defecto viene con el tema dark, ahora tiene el
tema Sky.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org9c01862" class="outline-3">
<h3 id="org9c01862">Sitio web</h3>
</div>

<div id="outline-container-org10ea311" class="outline-3">
<h3 id="org10ea311">LaTeX</h3>
<div class="outline-text-3" id="text-org10ea311">
<ul class="org-ul">
<li>Lo uso principalmente para la elaboración de documentos en
los que debo incluir muchas ecuaciones (su principal función).</li>
<li>Hasta ahora su integración en mi día a día se basaba en artículos
del instituto en el que tenía que presentar demostraciones
matemáticas y algún que otro ejercicio gráfico con Asymptote
(cabe recalcar que el uso de LaTeX no era parte de la clase).</li>
<li>En al universidad por he visto un uso limitado a 6 trabajos de la
asignatura de empresa y dos informes de laboratorio de física,
los apuntes son algo tediosos para pasarlos al ordenador, no
obstante espero mejorarlo este curso con este entorno.</li>
</ul>
</div>
</div>
<div id="outline-container-org4bdbf78" class="outline-3">
<h3 id="org4bdbf78">Emacs</h3>
<div class="outline-text-3" id="text-org4bdbf78">
<ul class="org-ul">
<li>Permite hacer todo lo que te puedas imaginar, edición, trabajo,
optimización del tiempo, es tu mejor aliado al momenot de
organizarte.</li>
<li>Empecé su uso hace un año pero lo he dejado en el camino, lo he
retomado para completar el entorno de trabajo/work-flow.
<ul class="org-ul">
<li>Paquetes que tengo actualmente:
<ul class="org-ul">
<li>pdf-tools</li>
<li>Auctex</li>
<li>mediawiki (ediciones en Wikiversidad)</li>
</ul></li>
</ul></li>
<li>Espero que sea un gran aliado durante este curso, para la
elaboración de apuntes, organización y otros trabajos.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd4e3490" class="outline-3">
<h3 id="orgd4e3490">HTML</h3>
<div class="outline-text-3" id="text-orgd4e3490">
<ul class="org-ul">
<li>El trabajo en HTML se reduce a aprender un lenguaje de marcado,
me gusta me parece interesante y quiero aprenderlo, mis prácticas
se reducen a editar el index.html de este repositorio.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf62f9f7" class="outline-3">
<h3 id="orgf62f9f7">CSS</h3>
<div class="outline-text-3" id="text-orgf62f9f7">
<ul class="org-ul">
<li>El trabajo realizado en CSS es básicamente por complementar el
conocimiento adquirido en HTML ya que el color, las animaciones y
todo lo que nos puede proporcionar CSS no tiene límites.</li>
</ul>
</div>
</div>
<div id="outline-container-org60a60b3" class="outline-3">
<h3 id="org60a60b3">Git</h3>
<div class="outline-text-3" id="text-org60a60b3">
<ul class="org-ul">
<li>Sin comentarios al respecto, hasta ahora había usado la interfaz
gráfica pero me parece que para hacer un workflow más eficiente
la consola de comando viene mejor por su simplicad y evitar
distracciones.</li>
</ul>
</div>
</div>
<div id="outline-container-org04ad71b" class="outline-3">
<h3 id="org04ad71b">Wikiversidad</h3>
<div class="outline-text-3" id="text-org04ad71b">
<ul class="org-ul">
<li>El conocimiento debe ser libre para todo el mundo, ser parte de
una comunidad poco activa es difícil pero creo que poco a poco
este proyecto puede resurgir y convertirse en lo que juró ser.</li>
</ul>
</div>
</div>
</div>
<div class="taglist"></div>
<div id="comments"><div id="hyvor-talk-view"></div>
<script type="text/javascript">
    var HYVOR_TALK_WEBSITE = 3390;
    var HYVOR_TALK_CONFIG = {
        url: false,
        id: location.pathname
    };
</script>
<script async type="text/javascript" src="//talk.hyvor.com/web-api/embed"></script></div></div>
<div id="postamble" class="status"></div>
</body>
</html>
